Merge pull request #58 from grainier/main
Miscellaneous fixes
